*╔════════════════════════════════════════════════════════════════════════╗
*║   Имя файла Get_S        Разработчик Андрей Васин                      ║
*╟────────────────────────────────────────────────────────────────────────╢
*║                                                                        ║
*║                        Ввод шаблона для поиска.                        ║
*║                                                                        ║
*╚══════════════════════════════════════════════════════════ 23.10.2008 ══╝
PROCEDURE Get_S
PARAMETERS sValue, prmTit

*
*  Переменные состояния для навигации
*

PRIVATE stat_type     && Тип навигации: 0 - нестандартный;
                                        1 - бланк;
                                        2 - BROWSE - таблица;
                                        3 - BROWSE - список.
PRIVATE what_do       && Имя режима.
PRIVATE menu_name     && Имя асинхронного меню.
PRIVATE last_mouse    && Время последнего нажатия звериной кнопки.
PRIVATE win_name      && Имя окна ( окон для BROWSE ).

*
*   Заполняем значениями переменные состояния...
*
stat_type  = 1
what_do    = ""
menu_name  = ""
last_mouse = 0
win_name   = PROGRAM()

*------------------------------------------------------------------------
*    Содержательная часть программы:
*
*
*┌───────────────────────────────────────────────┐
*│                                               │
*│ Задайте шаблон ....:....!....:....!....:....! │
*│                                               │
*│        < OK Ctrl-W > < Отказаться Esc >       │
*└───────────────────────────────────────────────┘

PRIVATE ex, tmpPatt, wd, l1
ex = 1
wd = MAX(38, 21+LEN(m.sValue))
m.tmpPatt = m.sValue
*------------------------------------------------------------------------

PUSH KEY CLEAR       && На всякий пожарный случай!
DO Prp_Nav_2
DO D_Win_N WITH 7, m.wd, IIF(TYPE("prmTit") = "C", prmTit, "Поиск")
*DO Sun_Bord WITH  2,  2,  4, 49, " Заголовок рамки "

*------------------------------------------------------------------------
*      Ввод полей бланка
*

m.l1 = FLOOR((WCOLS()-15-LEN(m.sValue))/2)
@ 3,  3 SAY "Задайте шаблон" GET tmpPatt
@ WROWS()-2, FLOOR(WCOLS()/2-16) GET ex PICTURE "@*HT \! OK Ctrl-W ;\? Отказаться Esc "

READ CYCLE

IF ex # 1
  *
  * Отрабатываем бланк
  tmpPatt = ""
ENDIF
*--------------------------------------------------------------------------

POP KEY
RELEASE WINDOW (win_name)
RETURN RTRIM(tmpPatt)
